package com.company;

public class MathClass {


    //возвести переменную в квадат
    public double Task03(int a){
        //TODO
        return 0;
    }
    //уменьшить значение переменной на 10
    public double Task02(int a){
        return a-10;
    }
    //уменьшить значение переменной на 4
    public double Task01(int a){
        //TODO
        return 0;
    }
    //посчитать сумму чисел
    public int Task001(int a, int b){
        return 0;
    }
    //посчитать разность чисел
    private int Task002(int a, int b){
        return 0;
    }

    //Дана сторона и периметр прямоугольника, найти вторую сторону
    public double Task1(double a, double P){
        //TODO
        return 0;
    }
    //Даны катеты  прямоугольного треугольника a и b. Найти сумму его гипотенузы и периметра Р
    public double Task2(double a, double b){
        //TODO
        return 0;
    }

    //x=0.5 y=4.5 a=25.74 b=105.30    51.48 23.4 2.2
    //известно, что Х кг шоколадных конфет стоит А рублей, а У кг ирисок стоит В рублей.
    // Определить, сколько стоит 1кг шоколажных конфет,
    //1 кг ирисок, а также во сколько раз шоколадные конфеты дороже ирисок
    public double Task3(double x, double y, double a, double b){
        //TODO
        double costX = 0;
        double costY = 0;
        double dis = 0;
        System.out.println("Стоимость 1кг шоколадных конфет: " + costX);
        System.out.println("Стоимость 1кг ирисок: " + costY);
        System.out.println("Во сколько раз шоколадные конфеты дороже ирисок: " + dis);
        return dis;
    }

    //решить линейное уравнение A*x+B=0 - найти х
    public double Task4(double a, double b){
        //TODO
        return 0;
    }

    //скорость первого автомобиля V1, второго V2. Расстояние между ними S км. определить расстояние между ними
    //через Т часов, если они удаляются друг от друга, двигаясь в противоположных направлениях.
    //данное расстояние равно сумме начального расстояния и общего пути, проделанного автомобилями.
    //общий путь = время * суммарная скорость
    public double Task5(double v1, double v2, double t, double s){
        //Todo
        return 0;
    }

    //дано значение температуры Т в градусах фаренгейта. перевести температуру в гадусы цельсия
    //температура по цельсию Тс и по фаренгейту Тf связаны отношением Tc=(Tf - 32)*5/9
    public double Task6(double T){
        //todo
        return 0;
    }
}
